export const CLUB_ASSOCIATION_RULES =
  "https://cafe.naver.com/ArticleList.nhn?search.clubid=26985838&search.menuid=19&search.boardtype=L";

export const DEPARTMENT_AUTONOMY_RULES = `제54조(분과자치규칙)
① 분과자치규칙은 분과학생회의 운영을 위해 각 분과 내에서 제정∙개정 및 폐지 가능한 자
치규칙을 칭한다.
② 분과자치규칙은 본회 회칙과 달리 성립하지 아니하고, 본회 회칙에 위반되는 자치규칙은
그 위반되는 부분에 한정하여 효력이 없다.
③ 분과자치규칙은 분과회의 내 의결을 통해 제정∙개정할 수 있다.
④ 확정된 분과자치규칙은 3일 이내에 공포하여야 하며 확정 5일 이후에 발효된다.
⑤ 분과자치규칙이 제정∙개정 및 폐지된 경우 분과학생회장은 지체 없이 차기 운영위원회에
해당 내용을 보고하여야 한다.
⑥ 분과학생회장은 매 정규학기 개강일 20일 이전까지 분과자치규칙 존재여부 및 최신 분과
자치규칙을 집행부에 송부해야 한다.
`;

export const CLUBS_COMPLIANCE_LIST = [
  "1. 동아리연합회칙을 준수하겠습니다.",
  "2. KAIST의 대학 문화 발전을 위해 이바지하겠습니다.",
  "3. 본 회의 민주적 의사결정에 성실히 참여하겠습니다.",
  "4. 분과자치규칙을 준수하겠습니다.",
];
